:PROPERTIES:
:ID: D9EAC6E8-F842-4DA8-93AC-11BAE7F5BA1C
:END:
#+title: Delete All Instance Databases
#+description: Delete All Instance Databases
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:sql:database_management:
#+created: 2026-05-21
#+updated: 2026-05-21

Delete all instance databases (preserves dev and test databases):

#+begin_src sql
select format('DROP DATABASE IF EXISTS %I;', database_name)
from ores_utility_ores_instance_databases_view \gexec
#+end_src

#+RESULTS:
#+begin_example
DROP DATABASE
#+end_example
